// Проверить существование по названию.
// 
// Параметры:
//  НазваниеТовара - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ПроверитьСуществованиеПоНазванию(НазваниеТовара) Экспорт
	
	ТаблицаТовары = Новый ТаблицаЗначений();
	ТаблицаТовары.Колонки.Добавить("Название");
	ТаблицаТовары.Колонки.Добавить("Цена");
	
	СтрокаТовары = ТаблицаТовары.Добавить();
	СтрокаТовары.Название = "Гитара";
	СтрокаТовары.Цена = 100;
	
	СтрокаТовары = ТаблицаТовары.Добавить();
	СтрокаТовары.Название = "Микрофон";
	СтрокаТовары.Цена = 50;
	
	ТоварСсылка = НайтиПоНаименованию(НазваниеТовара, Истина);
	Возврат НЕ ТоварСсылка.Пустая(); 	
КонецФункции